app/controllers/pages_controller.rb

  def list
    @pages = Page.order("pages.position ASC")
---
SELECT `pages`.* FROM `pages` ORDER BY pages.position ASC

  def create
    # Instantiate a new object using form parameters
    @page = Page.new(params[:page])
    # Save the object
    if @page.save
---
INSERT INTO `pages` (`created_at`, `name`, `permalink`, `position`, `subject_id`, `updated_at`, `visible`) VALUES ('2012-01-20 05:14:26', NULL, NULL, NULL, NULL, '2012-01-20 05:14:26', 0)