app/controllers/sections_controller.rb

  def list
    @sections = Section.order("sections.position ASC")
---
SELECT `sections`.* FROM `sections` ORDER BY sections.position ASC

  def create
    @section = Section.new(params[:section])
    if @section.save
---
INSERT INTO `sections` (`content`, `content_type`, `created_at`, `name`, `page_id`, `position`, `updated_at`, `visible`) VALUES (NULL, NULL, '2012-01-20 05:15:51', NULL, NULL, NULL, '2012-01-20 05:15:51', 0)

  def edit
    @section = Section.find(params[:id])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 3 LIMIT 1

  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(params[:section])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
UPDATE `sections` SET `content_type` = 'updated', `updated_at` = '2012-01-19 12:29:22' WHERE `sections`.`id` = 1

  def delete
    @section = Section.find(params[:id])
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def destroy
    Section.find(params[:id]).destroy
---
DELETE FROM `sections` WHERE `sections`.`id` = 5
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 5 LIMIT 1