app/controllers/subjects_controller.rb

  def list
    # assign all subjects in order from database to instance variable.
    @subjects = Subject.order("subjects.position ASC")
---
SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC

  def show
    # Set instance variable to be available in show.html.erb template
    # Set find method to pull in URL parameters from the browser request
    @subject = Subject.find(params[:id])
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1

  def new
    @subject = Subject.new
    @subject_count = Subject.count +1
---
SELECT COUNT(1) FROM `subjects`

  def create
  # Instantiate a new object using form parameters
  @subject = Subject.new(params[:subject])
  # Save the object
  @subject.save
  if @subject.save
  # if the save succeeds, redirect to the list action.
  redirect_to(:action => 'list')
  flash[:notice] = "Subject created succesfully."
else
  # if the save fails, redisplay the form so user can fix problem.
  # reset the subject_count variable
  @subject_count = Subject.count +1
---
INSERT INTO `subjects` (`created_at`, `name`, `position`, `updated_at`, `visible`) VALUES ('2012-01-17 19:58:15', 'Test Subject', 3, '2012-01-17 19:58:15', 0)
SELECT COUNT(1) FROM `subjects`

def edit
  @subject = Subject.find(params[:id])
  @subject_count = Subject.count
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `subjects`

  def update
  # Find object using form parameters
  @subject = Subject.find(params[:id])
  # Update the object
  if @subject.update_attributes(params[:subject])
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 3 LIMIT 1
UPDATE `subjects` SET `position` = 4, `updated_at` = '2012-01-17 20:59:58' WHERE `subjects`.`id` = 3

  def destroy
    Subject.find(params[:id]).destroy
---
DELETE FROM `subjects` WHERE `subjects`.`id` = 3
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 3 LIMIT 1